# coding=UTF-8

import random
from mimesis import Generic
from mimesis.locales import Locale

#============================================================================================
MSG_INFO = """
Это БОМЖ РПГ. v.{}

Скоро будут доступны функции 
    - Коллекционирования бомжей
    - PVP и PVE арен
    - Кланы и топы
    - Торговая площадка
    - И многое другое

Введеться активная разработка ждите. Devlog (https://t.me/plodovo_yagodniu)
"""
#============================================================================================
MSG_MENU = """
Главарь банды бомжей : <b>{}</b>
    Звание : {}

    📈 Рейтинг главаря : <b>{}</b>    
    👑 Статус : <b>{}</b> 
    <i>{}</i>

    💰 Рублей : <b>{}</b>
    💵 Доллоров : <b>{}</b>

    👥 Колличество бомжей в банде {}/5:\n
"""
#============================================================================================
MSG_INVENTORY = """
    ⚠️ Этот раздел еще не доделан ⚠️
"""
#============================================================================================
MSG_BANDA = """
Название банды : ''<i>Пипец жесткая банда #{}</i>''
    📈 Уровень банды : <b>{}</b>

    🥚 Доступно бомжен для призыва : <b>{}</b>

    👥 Члены банды :
"""
#============================================================================================
MSG_BANDA_ERROR_GET = """
<b>☹️ У вас нет доступных бомжей для призыва </b>
<i>Что получить новых нужно повысить уровень банды или купить ''Яйцо бомжа'' на торговой площадке</i>
"""
#============================================================================================
MSG_BOMZH_GET = """
<b>Вы призвали нового бомжа</b>
🧬 gen : <i>{}</i>
"""
#============================================================================================
MSG_BOMZH = """
Бомж {} [#{}] <i><b>{}</b></i>
🧬 gen : <i>{}</i>

    📈 Уровень : <b>{}</b>
    ✨ Опыт : <b>{}/{}</b>

    ❤️ ОЗ :  <b>{}/{}</b>
    🌀 Настроение : <b>{}/{}</b>
    🍕 Сытость : <b>{}/{}</b>
    ⚡ Энергия : <b>{}/{}</b>

    🧙‍♂️ Класс : нет <i>(Доступен с 5 уровня)</i>
    🔮 Активное умение : нет
    ❇️ Бафы :
        <i>нет</i>

    Сняряжение : 
        🪖 Шлём : нет
        👓 Амулеты : нет
        👔 Броник : нет
        👖 Штаны : нет
        👟 Подкрадули : нет

        ⚔️ Оружие : голые кулаки
"""
#============================================================================================
MSG_PRIME = """
На данный момент ПРЕМИУМ аккаунт не доступен
<i>Если хочешь узнать что дает ПРЕМИУМ --> /prime_info </i>
"""
#============================================================================================
MSG_STATUS = """

"""
#============================================================================================
MSG_PRIME_INFO = """

"""
#============================================================================================
MSG_SETTINGS = """

"""
#============================================================================================
MSG_STATUS = """
ℹ️ <b>Вы можете сменить своё звание : </b>
Звание отображается в глобальном поиске игроков. Список доступных званий :

<i>Что бы сменить звание нажмите на нужную кнопку</i>
"""
#============================================================================================
MSG_WORK = """
<b>Выберите тип и локацию работы: </b>
    ℹ️ <b>PVE</b> <i>- На таких локациях безопасно, вы не встретите бомжей из других банд. Но и колличество лута будет меньше.</i>
    ℹ️ <b>PVP</b> <i>- Лута в таких локациях больше, но бомжи могут подраться</i>

"""
#============================================================================================
MSG_FEED = """
<b>Выберите чем покормить бомжа:</b>
    ℹ️ <i>Дешевая еда дает сытость, но отнимает настроение, поэтому не жалейте рубли на еду</i>
"""
#============================================================================================
MSG_WORK_OK = """
✅ <b>Бомж успешо завершил работу</b>
Бомж нашел :
"""
#============================================================================================
MSG_WORK_ERROR = """
🆘 <b>Бомж не смог завершить работу</b>
<i>Когда он капался в мусоре его покусали крысы</i>
Бомж потерял :
"""
#============================================================================================


NAMES = ['Август', 'Августин', 'Альберт', 'Альфред', 'Арнольд', 'Артур', 'Базиль', 'Бенедикт', 'Бонифатий', 'Бонифаций', 'Витольд', 'Генрих', 'Герберт', 'Герман', 'Доминик', 'Донат', 'Карл', 'Корнелий', 'Кристиан', 'Леон', 'Леонард', 'Леопольд', 'Люциан', 'Люций', 'Максимилиан', 'Мартин', 'Марцелл', 'Ренат', 'Роберт', 'Себастьян', 'Симон', 'Теодор', 'Теодосий', 'Христиан', 'Эдвард', 'Эдмунд', 'Эдуард', 'Эмилиан', 'Эмилий', 'Эмиль', 'Эммануил', 'Эразм', 'Эрнест', 'Стефан', 'Вилли', 'Ричард', 'Эрик', 'Эрнст', 'Адольф', 'Гарри', 'Оскар', 'Даниэль', 'Эдгар', 'Эдвин', 'Людвиг', 'Отто', 'Марсель', 'Франциск', 'Фабиан', 'Аврелий', 'Адонис', 'Аполлон', 'Аскольд', 'Гвидон', 'Гектор', 'Геракл', 'Кронид', 'Ксенофонт', 'Марий', 'Нарцисс', 'Нестор', 'Орест', 'Платон', 'Рюрик', 'Сократ', 'Цезарь', 'Спартак', 'Гай', 'Ясон', 'Бова', 'Юлий', 'Юний', 'Эмилий', 'Франциск', 'Людовик', 'Генрих', 'Ромул', 'Рем', 'Ипполит', 'Артур', 'Тристан', 'Роланд', 'Карл', 'Зигмунд', 'Октавиан', 'Октавий', 'Фауст', 'Тиберий', 'Клавдий', 'Зенон', 'Адриан', 'Юлиан', 'Эмилиан', 'Флавий', 'Петроний', 'Зигфрид', 'Гермий', 'Фабиан', 'Ганнибал', 'Помпей', 'Тимур', 'Абакум', 'Абрам', 'Абрамий', 'Абросим', 'Авдей', 'Аверкий', 'Аверьян', 'Авксентий', 'Аврамий', 'Авсей', 'Автоном', 'Агап', 'Агафон', 'Аггей', 'Агей', 'Адриян', 'Азарий', 'Акакий', 'Аким', 'Акиндин', 'Акинф', 'Акинфий', 'Аксён', 'Аксентий', 'Алексей', 'Александр', 'Алим', 'Алфёр', 'Амвросий', 'Амос', 'Ананий', 'Анастасий', 'Андрей', 'Андриан', 'Андрон', 'Андроник', 'Аникей', 'Анисий', 'Анисим', 'Антип', 'Антон', 'Ануфрий', 'Арефий', 'Ардальон', 'Арсений', 'Арсентий', 'Артамон', 'Артём', 'Артемий', 'Архип', 'Афанасий', 'Африкан', 'Вавила', 'Валерьян', 'Варлам', 'Варфоломей', 'Василий', 'Виссарион', 'Власий', 'Влас', 'Гаврил', 'Гаврила', 'Гаврило', 'Галактион', 'Герасим', 'Глеб', 'Гордей', 'Григорий', 'Гурий', 'Гурьян', 'Давыд', 'Данил', 'Данила', 'Данило', 'Дементий', 'Демид', 'Демьян', 'Денис', 'Дмитрий', 'Дормедонт', 'Дормидонт', 'Дорофей', 'Евграф', 'Евдоким', 'Евлампий', 'Евсей', 'Евстафий', 'Евстигней', 'Евтихий', 'Егор', 'Егорий', 'Елизар', 'Елисей', 'Елистрат', 'Емельян', 'Епифан', 'Еремей', 'Ермил', 'Ермолай', 'Ерофей', 'Ефим', 'Ефрем', 'Захар', 'Захарий', 'Зиновий', 'Зосима', 'Иван', 'Игнат', 'Игнатий', 'Изот', 'Иларион', 'Илья', 'Иона', 'Ипат', 'Ипатий', 'Калистрат', 'Капитон', 'Карп', 'Касьян', 'Кирила', 'Кирило', 'Кирсан', 'Кирьяк', 'Клим', 'Климентий', 'Кондрат', 'Кондратий', 'Корней', 'Корнил', 'Кузьма', 'Куприян', 'Лавр', 'Лаврентий', 'Ларион', 'Лев', 'Леонтий', 'Лонгин', 'Лука', 'Лукьян', 'Макар', 'Максим', 'Мануйла', 'Мануйло', 'Марей', 'Маркел', 'Мартимьян', 'Мартын', 'Марьян', 'Матвей', 'Мелентий', 'Меркул', 'Мефодий', 'Милослав', 'Мина', 'Минай', 'Миней', 'Мирон', 'Мирослав', 'Митрофан', 'Михайла', 'Михайло', 'Михей', 'Мокей', 'Назар', 'Наум', 'Нафанаил', 'Нефёд', 'Никандр', 'Никанор', 'Никита','Никифор', 'Никодим', 'Николай', 'Никон', 'Нил', 'Нифонт', 'Осип', 'Павел', 'Памфил', 'Панкрат', 'Панкратий', 'Пантелей', 'Пантелеймон', 'Пантелеимон', 'Панфил', 'Парамон', 'Пармен', 'Парфён', 'Патрикей', 'Пафнутий', 'Пахом', 'Пётр', 'Пимен', 'Платон', 'Поликарп', 'Порфирий', 'Потап', 'Пров', 'Прокоп', 'Прокопий', 'Прокофий', 'Протас', 'Протасий', 'Прохор', 'Родион', 'Роман', 'Савва', 'Савватий', 'Савёл', 'Савелий', 'Самойла', 'Самойло', 'Самсон', 'Свирид', 'Севастьян', 'Северин', 'Северьян', 'Селиван', 'Селивёрст', 'Селифан', 'Семён', 'Серафим', 'Сергей', 'Сидор', 'Сила', 'Силантий', 'Созонт', 'Софрон', 'Спиридон', 'Степан', 'Сысой', 'Терентий', 'Тимофей', 'Тит', 'Тихон', 'Трифон', 'Трофим', 'Увар', 'Ульян', 'Устин', 'Фаддей', 'Фадей', 'Фёдор', 'Федос', 'Федосий', 'Федот', 'Федул', 'Феоктист', 'Фектист', 'Фофан', 'Ферапонт', 'Филарет', 'Филат', 'Филимон', 'Филипп', 'Фока', 'Фома', 'Фрол', 'Харитон', 'Харлам', 'Харлампий', 'Хрисанф', 'Яков', 'Юрий', 'Аарон', 'Аввакум', 'Августин', 'Авдий', 'Авенир', 'Аверкий', 'Авксентий', 'Авраам', 'Авраамий', 'Автоном', 'Агний', 'Адам', 'Агафон', 'Аггей', 'Адриан', 'Азарий', 'Акакий', 'Алексий', 'Алим', 'Амвросий', 'Амос', 'Ананий', 'Анастасий', 'Ангелин', 'Андроник', 'Анисий', 'Антип', 'Антоний', 'Онуфрий', 'Анфим', 'Аполлинарий', 'Аполлон', 'Ардалион', 'Арефий', 'Арий', 'Аристарх', 'Аркадий', 'Артемий', 'Артемон', 'Архипп', 'Афанасий', 'Афиноген', 'Африкан', 'Валериан', 'Варфоломей', 'Венедикт', 'Вениамин', 'Викентий', 'Викул', 'Вукол', 'Гавриил', 'Герасим', 'Герман', 'Гермоген', 'Гурий', 'Давид', 'Далмат', 'Дамиан', 'Даниил', 'Димитрий', 'Дионисий', 'Дорофей', 'Евграф', 'Евдоким', 'Евлампий', 'Евсевий', 'Евстафий', 'Евстигний', 'Евтихий', 'Елисей', 'Ефрем', 'Зенон', 'Зинон', 'Зиновий', 'Зосима', 'Иоанн', 'Игнатий', 'Иерофей', 'Иларий', 'Иларион', 'Иннокентий', 'Иосиф', 'Ипполит', 'Ираклий', 'Исаак', 'Исидор', 'Иустин', 'Каллистрат', 'Капитон', 'Карп', 'Кассиан', 'Киприан', 'Кир', 'Кириак', 'Кирилл', 'Клавдий', 'Климент', 'Корнилий', 'Кронид', 'Ксенофонт', 'Лавр', 'Лаврентий', 'Лазарь', 'Леонтий', 'Логгин', 'Мавр', 'Маврикий', 'Мавродий', 'Мануил', 'Мариан', 'Марк', 'Мартимиан', 'Мартин', 'Матфей', 'Меркурий', 'Мефодий', 'Мина', 'Мирон', 'Митрофан', 'Модест', 'Моисей', 'Мокий', 'Наркисс', 'Наум', 'Нафанаил', 'Нестор', 'Никандр', 'Никанор', 'Никифор', 'Никодим', 'Никон', 'Нил', 'Нифонт', 'Орест', 'Павлин', 'Памфил', 'Пантелеимон', 'Панфил', 'Парамон', 'Патрикий', 'Пафнутий', 'Пахом', 'Пимен', 'Платон', 'Поликарп', 'Порфирий', 'Патапий', 'Прокл', 'Прокопий', 'Протасий', 'Прохор', 'Савва', 'Савватий', 'Самсон', 'Самуил', 'Севастиан', 'Севериан', 'Северин', 'Серапион', 'Серафим', 'Сергий', 'Сила', 'Сильвестр', 'Симон', 'Сократ', 'Соломон', 'Феликс', 'Феодор', 'Феодосий', 'Феоктист', 'Стефан', 'Фаддей', 'Феофан', 'Филарет', 'Феофилакт', 'Филон', 'Фирс', 'Фока', 'Фома', 'Харитон', 'Ювеналий' ]

PATRONIMS = ["Августович","Августинович","Альбертович","Альфредович","Арнольдович","Артурович","Базильевич","Бенедиктович","Бонифатиевич","Бонифациевич","Витольдович","Генрихович","Гербертович","Германович","Доминикович","Донатович","Карлович","Корнелиевич","Кристианович","Леонович","Леонардович","Леопольдович","Люцианович","Люциевич","Максимилианович","Мартинович","Марцеллович","Ренатович","Робертович","Себастьянович","Симонович","Теодорович","Теодосьевич","Христианович","Эдвардович","Эдмундович","Эдуардович","Эмилианович","Эмильевич","Эмильевич","Эммануилович","Эразмович","Эрнестович","Стефанович","Виллиевич","Ричардович","Эрикович","Эрнстович","Адольфович","Гарриевич","Оскарович","Даниэлевич","Эдгарович","Эдвинович","Людвигович","Оттович","Аврелиевич","Адонисович","Аполлонович","Аскольдович","Гвидонович","Гекторович","Гераклович","Кронидович","Ксенофонтович","Мариевич","Нарциссович","Несторович","Орестович","Платонович","Русланович","Рюрикович","Сократович","Цезаревич","Абакумович","Абрамович","Абрамиевич","Абросимович","Авдеевич","Аверкиевич","Аверьянович","Авксентьевич","Аврамиевич","Авсеевич","Автономович","Агапович","Агафонович","Аггеевич","Агеевич","Адриянович","Азарьевич","Акакиевич","Акимович","Акиндинович","Акинфович","Акинфиевич","Аксёнович","Аксентьевич","Алексеевич","Александрович","Алимович","Алфёрович","Амвросиевич","Амосович","Ананиевич","Анастасьевич","Андреевич","Андрианович","Андронович","Андроникович","Аникеевич","Анисиевич","Анисимович","Антипович","Антонович","Ануфриевич","Арефьевич","Ардальонович","Арсеньевич","Арсентьевич","Артамонович","Артёмович","Артемиевич","Архипович","Афанасьевич","Африканович","Вавилич","Валерьянович","Варламович","Варфоломеевич","Васильевич","Виссарионович","Власиевич","Власович","Гаврилович","Гаврилович","Гаврилович","Галактионович","Герасимович","Глебович","Гордеевич","Григорьевич","Гурьевич","Гурьянович","Давыдович","Данилович","Данилович","Данилович","Дементьевич","Демидович","Демьянович","Денисович","Дмитриевич","Дормедонтович","Дормидонтович","Дорофеевич","Евграфович","Евдокимович","Евлампиевич","Евсеевич","Евстафьевич","Евстигнеевич","Евтихиевич","Егорович","Егорьевич","Елизарович","Елисеевич","Елистратович","Емельянович","Епифанович","Еремеевич","Ермилович","Ермолаевич","Ерофеевич","Ефимович","Ефремович","Захарович","Захарьевич","Зиновьевич","Зосимович","Иванович","Игнатович","Игнатьевич","Изотович","Иларионович","Ильич","Ионич","Ипатович","Ипатьевич","Калистратович","Капитонович","Карпович","Касьянович","Кириллович","Кириллович","Кирсанович","Кирьякович","Климович","Климентьевич","Кондратович","Кондратьевич","Корнеевич","Корнилович","Кузьмич","Куприянович","Лаврович","Лаврентиевич","Ларионович","Львович","Леонтьевич","Лонгинович","Лукич","Лукьянович","Макарович","Максимович","Мануйлович","Мануйлович","Марьевич","Маркелович","Мартимьянович","Мартынович","Марьянович","Матвеевич","Мелентьевич","Меркулович","Мефодиевич","Милославович","Минич","Минаевич","Минеевич","Миронович","Мирославович","Митрофанович","Михайлович","Михайлович","Михеевич","Мокеевич","Назарович","Наумович","Нафанаилович","Нефёдович","Никандрович","Никанорович","Никитич","Никифорович","Никодимович","Николаевич","Никонович","Нилович","Нифонтович","Осипович","Павлович","Памфилович","Панкратович","Панкратьевич","Пантелеевич","Пантелеймонович","Пантелеимонович","Панфилович","Парамонович","Парменович","Парфёнович","Патрикеевич","Пафнутьевич","Пахомович","Петрович","Пименович","Платонович","Поликарпович","Порфирьевич","Потапович","Прович","Прокопович","Прокопьевич","Прокофьевич","Протасович","Протасьевич","Прохорович","Родионович","Романович","Саввич","Савватьевич","Савёлович","Савельевич","Самойлович","Самойлович","Самсонович","Свиридович","Севастьянович","Северинович","Северьянович","Селиванович","Селивёрстович","Селифанович","Семёнович","Серафимович","Сергеевич","Сидорович","Силич","Силантьевич","Созонтович","Софронович","Спиридонович","Степанович","Сысоевич","Терентьевич","Тимофеевич","Титович","Тихонович","Трифонович","Трофимович","Уварович","Ульянович","Устинович","Фаддеевич","Фадеевич","Фёдорович","Федосович","Федосьевич","Федотович","Федулович","Феоктистович","Фектистович","Феофанович","Ферапонтович","Филаретович","Филатович","Филимонович","Филиппович","Фокич","Фомич","Фролович","Харитонович","Харламович","Харлампиевич","Хрисанфович","Яковлевич","Юрьевич","Ааронович","Аввакумович","Августинович","Авдиевич","Авенирович","Аверкиевич","Авксентьевич","Авраамович","Авраамиевич","Автономович","Агниевич","Адамович","Агафонович","Аггеевич","Адрианович","Азарьевич","Акакиевич","Алексиевич","Алимович","Амвросиевич","Амосович","Ананиевич","Анастасьевич","Ангелинович","Андроникович","Анисиевич","Антипович","Антониевич","Онуфриевич","Анфимович","Аполлинариевич","Аполлонович","Ардалионович","Арефьевич","Ариевич","Аристархович","Аркадьевич","Артемиевич","Артемонович","Архиппович","Афанасьевич","Афиногенович","Африканович","Валерианович","Варфоломеевич","Венедиктович","Вениаминович","Викентьевич","Викулович","Вуколович","Гавриилович","Герасимович","Германович","Гермогенович","Гурьевич","Давидович","Далматович","Дамианович","Даниилович","Димитриевич","Дионисиевич","Дорофеевич","Евграфович","Евдокимович","Евлампиевич","Евсевиевич","Евстафьевич","Евстигниевич","Евтихиевич","Елисеевич","Ефремович","Зенонович","Зинонович","Зиновьевич","Зосимович","Иоаннович","Игнатьевич","Иерофеевич","Илариевич","Иларионович","Иннокентьевич","Иосифович","Ипполитович","Ираклиевич","Исаакович","Исидорович","Иустинович","Каллистратович","Капитонович","Карпович","Кассианович","Киприанович","Кирович","Кириакович","Кириллович","Клавдиевич","Климентович","Корнилиевич","Кронидович","Ксенофонтович","Лаврович","Лаврентиевич","Лазаревич","Леонтьевич","Логгинович","Маврович","Маврикиевич","Мавродиевич","Мануилович","Марианович","Маркович","Мартимианович","Мартинович","Матфеевич","Меркуриевич","Мефодиевич","Минич","Миронович","Митрофанович","Модестович","Моисеевич","Мокиевич","Наркиссович","Наумович","Нафанаилович","Несторович","Никандрович","Никанорович","Никифорович","Никодимович","Никонович","Нилович","Нифонтович","Орестович","Павлинович","Памфилович","Пантелеимонович","Панфилович","Парамонович","Патрикиевич","Пафнутьевич","Пахомович","Пименович","Платонович","Поликарпович","Порфирьевич","Патапиевич","Проклович","Прокопьевич","Протасьевич","Прохорович","Саввич","Савватьевич","Самсонович","Самуилович","Севастианович","Северианович","Северинович","Серапионович","Серафимович","Сергиевич","Силич","Сильвестрович","Симонович","Сократович","Соломонович","Феликсович","Феодорович","Феодосиевич","Феоктистович","Стефанович","Фаддеевич","Феофанович","Филаретович","Феофилактович","Филонович","Фирсович","Фокич","Фомич","Харитонович","Ювеналиевич"]

def genName():
    names_c = len(NAMES)
    rnd_name_n = random.randint(1, names_c)
    name = NAMES[rnd_name_n]

    patronims_c = len(PATRONIMS)
    rnd_patronim_n = random.randint(1, patronims_c)
    patronim = PATRONIMS[rnd_patronim_n]

    # generic = Generic(locale=Locale.RU)

    fnl_str = "{} {}".format(name, patronim)
    return fnl_str

# =============================================================================================================
# =============================================================================================================
# =============================================================================================================
# =============================================================================================================

STATUSES = [
    "♂ dungeon master ♂",
    "♂ dungeon master ♂ slave",
    "🆘 альфа sus 🆘",
    "💎 Украл у мамки кошелек 💎"
]

LOCATIONS = [
    ["ЖЭК 'Подметать дворы'","",1,True,5, 1, 2,3,20,100,120,0,75,10,15,5],
    ["ЖЭК 'Убирать подъезды'","",3,True,5, 1, 2,3,20,100,120,0,75,10,15,5],
    ["ЖЭК 'Красить лавки'","",3,True,5, 1, 2,3,20,100,120,0,75,10,15,5],
    ["Макдак","",7,True,5, 1, 2,3,20,100,120,0,75,10,15,5],
    ["Работа курьером","",7,True,5, 1, 2,3,20,100,120,0,75,10,15,5],
    ["Работа на полигоне","",7,True,5, 1, 2,3,20,100,120,0,75,10,15,5],

    ["Искать мусор по мусоркам","",1,False,5, 1, 2,3,20,100,120,0,75,10,15,5],
    ["Ловить котов","",1,False,5, 1, 2,3,20,100,120,0,75,10,15,5],
    ["П*зд*ть медь","",4,False,5, 1, 2,3,20,100,120,0,75,10,15,5],
    ["Искать клады","",4,False,5, 1, 2,3,20,100,120,0,75,10,15,5],
    ["Подъпольные бои","",6,False,5, 1, 2,3,20,100,120,0,75,10,15,5],
    ["Искать бутылки","",6,False,5, 1, 2,3,20,100,120,0,75,10,15,5],
    ["Работать в ♂ GUM ♂","",6,False,5, 1, 2,3,20,100,120,0,75,10,15,5],
]

TYPES = [
    "Оружие", #1
    "Шлём", #2
    "Амулет", #3
    "Броник", #4
    "Штаны", #5
    "Подкрадули", #6
    "Еда", #7
    "Зелья", #8
    "Яйцо бомжа", #9
    "Осколки", #10
    "Мусор", #11
    "Свитки", #12
    "Медали", #13
]

SUB_TYPES = [
    "Ближний бой",
    "Дальний бой",
    "Магическое",
    "Квантовое",
    "Легкий",
    "Средний",
    "Тяжелый",
    "Кольцо",
    "Инструмент",
]

ITEMS = [
    ['Гнилые яблоки', '', 7, None, 1, None, None, None, None, None, 1, -40, False, True, True, 0], 
    ['Испорченый бутерброд', '', 7, None, 1, None, None, None, None, None, 1, -20, False, True, True, 40], 
    ['Хеппи Милл', '', 7, None, 1, None, None, None, None, None, 1, 10, False, True, True, 110], 
    ['Чесночный хлеб', '', 7, None, 1, None, None, None, None, None, 1, 10, False, True, True, 65],

    ['Ржавый металический лом', '', 11, None, 1, None, None, None, None, None, None, None, False, False, False, None],
    ['Металолом', '', 11, None, 2, None, None, None, None, None, None, None, False, False, False, None],
    ['Цвет.мет.', '', 11, None, 3, None, None, None, None, None, None, None, False, False, False, None],

    ['Провода', '', 11, None, 1, None, None, None, None, None, None, None, False, False, False, None],
    ['Старые батарейки', '', 11, None, 2, None, None, None, None, None, None, None, False, False, False, None],
    ['Радио детали', '', 11, None, 3, None, None, None, None, None, None, None, False, False, False, None],

    ['Мукалатура', '', 11, None, 1, None, None, None, None, None, None, None, False, False, False, None],
    ['Грязные обои', '', 11, None, 2, None, None, None, None, None, None, None, False, False, False, None],
    ['Журналы \'Максим\'', '', 11, None, 3, None, None, None, None, None, None, None, False, False, False, None],

    ['Грязные тряпки', '', 11, None, 1, None, None, None, None, None, None, None, False, False, False, None],
    ['Рваные трусы', '', 11, None, 2, None, None, None, None, None, None, None, False, False, False, None],
    ['Одежда из сека', '', 11, None, 3, None, None, None, None, None, None, None, False, False, False, None],
]

    # id = db.Column(db.Integer, primary_key=True)
    # location = db.Column(db.Integer, db.ForeignKey('location.id'), unique=False, nullable=False)
    # chance = chance = db.Column(db.Integer, unique=False, nullable=False, default=50)
    # chance_max = chance = db.Column(db.Integer, unique=False, nullable=False, default=50)
    # extr_chance = chance = db.Column(db.Integer, unique=False, nullable=False, default=50)
    # extr_chance_max = chance = db.Column(db.Integer, unique=False, nullable=False, default=50)
    # money_drop = db.Column(db.Integer, unique=False, nullable=False, default=0)
    # gold_drop = db.Column(db.Integer, unique=False, nullable=False, default=0)
    # exp_drop = db.Column(db.Integer, unique=False, nullable=False, default=0)
    # joy_drop = db.Column(db.Integer, unique=False, nullable=False, default=0)
    # joy_lost = db.Column(db.Integer, unique=False, nullable=False, default=0)
    # hp_lost = db.Column(db.Integer, unique=False, nullable=False, default=0)

LOCKS_DROP = [
    [1,]
]